app/controllers/school_classes_controller.rb

  def create
<<<<<<< HEAD
    @school_class = SchoolClass.new(post_params(:school_class))
=======
    @school_class = SchoolClass.new(params.require(:school_class))
>>>>>>> 72383698f77ca412e00b6038426d86b0c6a49ec9
    @school_class.save
---
INSERT INTO "school_classes" DEFAULT VALUES