app/controllers/students_controller.rb

  def create
<<<<<<< HEAD
    @student = Student.new(post_params(:student))
=======
    @student = Student.new(params.require(:student))
>>>>>>> 72383698f77ca412e00b6038426d86b0c6a49ec9
    @student.save
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-06-22 23:07:50.284536"], ["updated_at", "2020-06-22 23:07:50.284536"]]